#include <iostream>

/*  Неномерирани шаблонни параметри (Non-type Template Parameters)
    *   Неномерираните шаблонни параметри са шаблонни параметри, които не са типове, а константни стойности.

    *   Те могат да са някое от следните:
        - Цяло число
        - Изброителен тип
        - std::nullptr_t
        - Число с плаваща запетая (от C++20)
        - Указател или референция към обект
        - Указател или референция към функция
        - Указател или референция към член-функция
        - Литерален клас (от C++20)
*/

template <int N>
void print() {
    std::cout << "Value: " << N << std::endl;
}

int main() {
    print<5>(); // Извежда: Value: 5
    print<10>(); // Извежда: Value: 10

    print<'c'>(); // Извежда: Value: 99 (ASCII стойността на 'c')

    return 0;
}
